{
  "messages_for_sad": [
    "This tough time will pass, and brighter days are ahead.",
    "Every storm eventually clears, revealing the sunshine again.",
    "It's okay to feel sad sometimes. Emotions are part of the journey.",
    "Even small steps forward are signs of strength and progress.",
    "There is so much strength within. Keep going, one step at a time.",
    "Difficult moments often lead to the greatest growth.",
    "Take a deep breath and let hope fill the heart.",
    "A smile will find its way back, even if it takes time.",
    "Support and love are always around, even in tough times.",
    "Keep pushing forward—there is so much to look forward to."
  ],
  "messages_for_angry": [
     "Take a deep breath and give yourself a moment to pause.",
    "Anger is temporary—focus on finding peace within.",
    "Step away for a bit and allow the mind to clear.",
    "Not every battle needs to be fought right now. Choose peace.",
    "Breathe in slowly, hold, and exhale. Let the tension fade away.",
    "A calm mind finds better solutions than an angry one.",
    "Let go of what can’t be controlled and focus on what brings peace.",
    "Frustration is natural, but it doesn’t have to control the day.",
    "Words said in anger are hard to take back—take a moment before responding.",
    "Redirect that energy into something positive. A clear mind leads to better outcomes."
  ],
  "messages for happy": [
     "Happiness looks great on you! Keep shining.",
    "Enjoy this moment—joy is meant to be felt fully.",
    "Happiness is contagious—spread it everywhere!",
    "Hold onto this feeling and let it brighten your days.",
    "Every smile adds a little more light to the world.",
    "Keep embracing the things that bring joy and laughter.",
    "Let happiness be the fuel that keeps you moving forward.",
    "Celebrate the good times, big or small!",
    "Happiness grows when shared—let others feel the warmth too.",
    "Stay present in this moment, and let joy fill your heart."
  ],
  "messages for bored": [
    
  ]
}
