{
  "messages_for_sad": [
    "This tough time will pass, and brighter days are ahead.",
    "Every storm eventually clears, revealing the sunshine again.",
    "It's okay to feel sad sometimes. Emotions are part of the journey.",
    "Even small steps forward are signs of strength and progress.",
    "There is so much strength within. Keep going, one step at a time.",
    "Difficult moments often lead to the greatest growth.",
    "Take a deep breath and let hope fill the heart.",
    "A smile will find its way back, even if it takes time.",
    "Support and love are always around, even in tough times.",
    "Keep pushing forward—there is so much to look forward to."
  ],
  "messages_for_angry": [
     "Take a deep breath and give yourself a moment to pause.",
    "Anger is temporary—focus on finding peace within.",
    "Step away for a bit and allow the mind to clear.",
    "Not every battle needs to be fought right now. Choose peace.",
    "Breathe in slowly, hold, and exhale. Let the tension fade away.",
    "A calm mind finds better solutions than an angry one.",
    "Let go of what can't be controlled and focus on what brings peace.",
    "Frustration is natural, but it doesn't have to control the day.",
    "Words said in anger are hard to take back—take a moment before responding.",
    "Redirect that energy into something positive. A clear mind leads to better outcomes."
  ],
  "messages_for_happy": [
     "Happiness looks great on you! Keep shining.",
    "Enjoy this moment—joy is meant to be felt fully.",
    "Happiness is contagious—spread it everywhere!",
    "Hold onto this feeling and let it brighten your days.",
    "Every smile adds a little more light to the world.",
    "Keep embracing the things that bring joy and laughter.",
    "Let happiness be the fuel that keeps you moving forward.",
    "Celebrate the good times, big or small!",
    "Happiness grows when shared—let others feel the warmth too.",
    "Stay present in this moment, and let joy fill your heart."
  ],
  "messages_for_bored": [
    "Boredom is just the universe nudging you to try something new. What's one small thing you can do differently today?",
    "Feeling bored? Maybe it's time to dive into a random fun fact or learn a weird skill!",
    "Boredom is a sign of untapped creativity. What's one small project or idea you can explore?",
    "Try stepping outside, stretching, or listening to a song you haven't heard before. Change the vibe!",
    "Your next adventure might be one decision away. What's something spontaneous you can do right now?"
  ],
  "messages_for_calm": [
    "Enjoy this moment of peace. Let it refill your energy for whatever comes next.",
    "Calmness is power. Stay in this moment and let it guide you forward.",
    "Breathe in, breathe out. Right now, everything is okay.",
    "A calm mind makes the best decisions. Keep that steady energy!",
    "You are in control. Enjoy the stillness and let it bring you clarity."
  ],
  "messages_for_concerned": [
    "It's okay to feel concerned. Acknowledge your thoughts, but don't let them take over.",
    "Worrying means you care. Focus on what you can control, and take it one step at a time.",
    "You don't have to figure everything out at once. Small steps can lead to big solutions.",
    "Talk it out with someone you trust—sometimes, an outside perspective helps ease the mind.",
    "Breathe. Stay present. You've handled challenges before, and you'll get through this one too."
  ],
  "messages_for_determined": [
    "You've got this! Keep pushing forward—small steps lead to big victories.",
    "Determination fuels success. Stay focused, and trust the process.",
    "Your dedication is what sets you apart. Keep moving, and you'll get there!",
    "Every great achievement starts with determination. Stay strong, stay steady.",
    "Obstacles are just part of the journey. Keep going—you are unstoppable!"
  ],
  "messages_for_funky": [
    "Let your weirdness shine! The world needs your unique energy.",
    "Dance like nobody's watching, sing like nobody's listening. Funk it up!",
    "Being funky means living life on your terms. Own it!",
    "Your vibe is contagious—keep spreading the funk!",
    "Why fit in when you were born to stand out? Embrace your funky side!"
  ],
  "messages_for_overstimulated": [
    "Take a deep breath. Step away from the noise and give yourself a moment to reset.",
    "Feeling overwhelmed? Try closing your eyes for a few seconds and focusing on your breath.",
    "It's okay to take a break. Your well-being comes first.",
    "Find a quiet space, put on some calming music, and allow yourself to decompress.",
    "The world can wait. Prioritize your peace and take things one step at a time."
  ],
  "messages_for_socially anxious": [
    "You are not alone in this feeling. Breathe deeply and take it one moment at a time.",
    "You don't have to say the perfect thing—just being present is enough.",
    "It's okay to step away and take a break. Your comfort matters.",
    "You are worthy of connection. The right people will appreciate you as you are.",
    "Remember, most people are too busy with their own thoughts to judge you. Just be yourself!"
  ],
  "messages_for_tired": [
    "Rest is productive too. Give yourself the break you deserve.",
    "You've done enough today. It's okay to recharge and come back stronger.",
    "Sleep, water, and kindness to yourself—your body and mind will thank you.",
    "Sometimes the best thing you can do is close your eyes and let yourself rest.",
    "Energy will return, but for now, allow yourself to slow down and breathe."
  ]
}
